Table of Contents
 Class CutBeamByBeamData
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Provides data of the cut objec by object
public class CutBeamByBeamData
Inheritance
object
CutBeamByBeamData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CutPart
CutPart - The part of the stiffening member which is cut off
public CutPart CutPart { get; set; }
Property Value
CutPart
 CuttingObject
Cutting by object
public ReferenceElement CuttingObject { get; set; }
Property Value
ReferenceElement
 IsWeld
is cut welded
public bool IsWeld { get; set; }
Property Value
bool
 Method
Cut Method For cut beam by neagtive object is reqied method Surface
public CutMethod Method { get; set; }
Property Value
CutMethod
 ModifiedObject
Modified object
public ReferenceElement ModifiedObject { get; set; }
Property Value
ReferenceElement
 Offset
Offset
public double Offset { get; set; }
Property Value
double
 Orientation
Cut Orientation
public CutOrientation Orientation { get; set; }
Property Value
CutOrientation
 PlaneOnCuttingObject
PlaneOnCuttingObject
public DistanceComparison PlaneOnCuttingObject { get; set; }
Property Value
DistanceComparison
 WeldThickness
Thickness of the weld - value 0 = recommended size
public double WeldThickness { get; set; }
Property Value
double
 WeldType
Type of the weld
public WeldType WeldType { get; set; }
Property Value
WeldType
 Edit this page